# определяем базовый образ, который будет взят за основу
FROM node:16.15.0

# Затем создадим директорию для кода приложения внутри образа. Это будет рабочая папка для вашего приложения.
WORKDIR /usr/src/app

# установка зависимостей
# символ астериск ("*") используется для того чтобы по возможности
# скопировать оба файла: package.json и package-lock.json
COPY package*.json ./

RUN npm install
# Если вы создаете сборку для продакшн
# RUN npm ci --only=production

# копируем исходный код
COPY . .

# Сервер привязан к 8080 порту, поэтому мы будем использовать инструкцию EXPOSE,
# чтобы проинформировать Docker о том, что в контейнере имеется приложение, прослушивающее этот порт.
EXPOSE 8080

# команда CMD содержит все необходимые переменные среды и инструкции для запуска приложения.
# Здесь мы просто используем node server.js для запуска.
CMD [ "node", "server.js" ]